import 'package:flutter/material.dart';
import 'package:school_app/screens/setting_screen.dart';
import 'package:school_app/utils/color_util.dart';
import 'package:school_app/widgets/reusable_widget.dart';

class SpnvsPage extends StatelessWidget {
  const SpnvsPage({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      extendBodyBehindAppBar: true,
      appBar: AppBar(
        backgroundColor: Colors.transparent,
        centerTitle: false,
        title: const Text(
          "School Info",
          style: TextStyle(fontSize: 24, fontWeight: FontWeight.bold,color: Colors.black),
        ),
        actions: [
          IconButton(
            onPressed: (){
              Navigator.push(context,
                    MaterialPageRoute(builder: (context) {
                      const settingScreen =  SettingScreen();
                      return settingScreen;
                    }));
            },
            icon: const Icon(Icons.more_vert,color:Colors.black,),
          ),
        ],
      ),
      body: Container(
          width: MediaQuery.of(context).size.width,
          height: MediaQuery.of(context).size.height,
          decoration: BoxDecoration(
              gradient: LinearGradient(colors: [
            hexStringToColor("CB2B93"),
            hexStringToColor("9546C4"),
            hexStringToColor("5E61F4")
            ],
            begin: Alignment.topCenter,
            end: Alignment.bottomCenter,
            )),
          child: SingleChildScrollView(
            child: Padding(
             padding: const EdgeInsets.fromLTRB(20, 50, 20, 0),
             child: Column(
              children: <Widget>[
                ClipOval(
                child: SizedBox.fromSize(
                  size: const Size.fromRadius(90), // Image radius
                  child:  logoWidgetPublicSchoolScreen('asset/images/spnvs.png'),
                  ),
                ),
                const SizedBox(
                  height: 10.0,
                ),
                Container(
                  decoration: BoxDecoration(
                    border: Border.all(
                      color: Colors.black,
                      width: 2,
                    ),
                    borderRadius: BorderRadius.circular(10),
                    boxShadow: const [
                      BoxShadow(
                        color: Color.fromARGB(125, 158, 158, 158),
                      ),
                    ],
                  ),
                  child: const Center(
                    child: Text("សាកលវិទ្យាល័យភូមិន្ទនីតិសាស្ត្រនិងវិទ្យាសាស្ត្រសេដ្ឋកិច្ច RULES ត្រូវបានបង្កើតឡើងដំបូងនៅឆ្នាំ ១៩៤៨ ដោយមានឈ្មោះថាវិទ្យាស្ថានជាតិនីតិសាស្ត្រ នយោបាយ និង សេដ្ឋកិច្ច ហើយត្រូវបានប្តូរឈ្មោះដូចបច្ចុប្បន្ននៅឆ្នាំ២០០៣។សាកលវិទ្យាល័យភូមិន្ទនីតិសាស្ត្រនិងវិទ្យាសាស្ត្រសេដ្ឋកិច្ច ជាសាកលវិទ្យាល័យដែលចំណាស់ជាងគេនៅក្នុងគ្រឹះស្ថានឧត្ដមសិក្សានៃព្រះរាជាណាចក្រកម្ពុជា។ សាកលវិទ្យាល័យភូមិន្ទនីតិសាស្ដ្រនិងវិទ្យាសាស្ដ្រសេដ្ឋកិច្ច ត្រូវបានបង្កើតឡើងនៅឆ្នាំ ១៩៤៨ ក្នុងទំរង់ជា វិទ្យាស្ថាននីតិសាស្ដ្រ នយោបាយ និងសេដ្ឋកិច្ច។ ក្នុងឆ្នាំ ២០០៣ ស្ថាប័ននេះត្រូវបានប្រកាសជាផ្លូវការជា សាកលវិទ្យាល័យ។ សាកលវិទ្យាល័យភូមិន្ទនីតិសាស្ដ្រនិងវិទ្យាសាស្ដ្រសេដ្ឋកិច្ច គឺជាគ្រឹះស្ថានឧត្ដមសិក្សាដំបូងបង្អស់នៃព្រះរាជាណាចក្រកម្ពុជា។ សាកលវិទ្យាល័យនេះត្រូវបានបង្កើតឡើងដំបូងបង្អស់នៅឆ្នាំ ១៩៤៨ ក្នុងនាមជា វិទ្យាស្ថាននីតិសាស្ដ្រ នយោបាយ និងសេដ្ឋកិច្ច។ ឆ្នាំ ១៩៥៧ គឺជាឆ្នាំមួយសម្រាប់ប្រវត្ដិសាស្ដ្រនៃសាកលវិទ្យាល័យ វិទ្យាស្ថានបានប្រែក្លាយជាមហាវិទ្យាល័យដោយព្រះរាជក្រឹត្យ។ ឆ្នាំ ២០០៣ គឺឆ្នាំដ៏សំខាន់មួយសម្រាប់ប្រវត្ដិសាស្ដ្រសាកលវិទ្យាល័យ។ មហវិទ្យាល័យនីតិសាស្ដ្រនិងវិទ្យាសាស្ដ្រសេដ្ឋកិច្ច ត្រូវបានទទួលស្គាល់ជាសាកលវិទ្យាល័យក្រោមនាមជា សាកលវិទ្យាល័យភូមិន្ទនីតិសាស្ដ្រនិងវិទ្យាសាស្ដ្រសេដ្ឋកិច្ច។ ឈ្មោះនៃសាកលវិទ្យាល័យនៅតែភ្ជាប់នូវពាក្យ នីតិសាស្ដ្រនិងវិទ្យាសាស្ដ្រសេដ្ឋកិច្ចដដែល ដើម្បីចង្អុលបង្ហាញថាមុខវិជ្ជាទាំងពីរនេះគឺជា មុខវិជ្ជាគោលសម្រាប់កម្មវិធីសិក្សានៃសាកលវិទ្យាល័យ។ ទោះបីជាយ៉ាងណាក៏ដោយ មុខវិជ្ជាដទៃទៀតនៃផ្នែកវិទ្យាសាស្ដ្រសង្គម និងធម្មជាតិ ដូចជា ភាសា និងវិទ្យាសាស្ដ្រកុំទ្យូទ័រកំពុងត្រូវបានដាក់បញ្ចូលក្នុងកម្មវិធីសិក្សា។ ថ្មីៗនេះ សាកលវិទ្យាល័យមានមហាវិទ្យាល័យចំនួន ៤ ថ្នាក់ក្រោយឧត្ដមសិក្សា ២ និងមជ្ឈមណ្ឌល ១។ សាកលវិទ្យាល័យភូមិន្ទនីតិសាស្ដ្រនិងវិទ្យាសាស្ដ្រសេដ្ឋកិច្ច នៅតែរក្សាតំណែងរបស់ខ្លួនជាសាកលវិទ្យាល័យជាតិចំបង និងជាសាកលវិទ្យាល័យឈានមុខគេក្នុងរង្វង់មុខវិជ្ជានីតិសាស្ដ្រ សេដ្ឋកិច្ច និងអប់រំពាណិជ្ជកម្ម។ដោយដឹងថាផ្នែកសាធារណៈ និងផ្នែកឯកជនគឺជាសសរស្ដម្ភក្នុងការទ្រទ្រង់ការអភិវឌ្ឍន៍នៃព្រះរាជាណាចក្រកម្ពុជា សាកលវិទ្យាល័យបានពង្រីកគោលដៅរបស់ខ្លួន។ ជាទម្លាប់ គោលដៅតែមួយគត់របស់សាកលវិទ្យាល័យគឺដើម្បីអភិវឌ្ឍន៍ធនធានមនុស្សសម្រាប់វិស័យសាធារណៈ។ ប៉ុន្ដែបច្ចុប្បន្ន គោលដៅនេះបានពង្រីកវិសាលភាពដោយបញ្ចូលវិស័យឯកជនផងដែរ។ កម្មវិធីបណ្ដុះបណ្ដាលផ្សេងៗនៃផ្នែកគ្រប់គ្រងពាណិជ្ជកម្មត្រូវបានបង្កើតឡើង និងអភិវឌ្ឍ ទទួលស្គាល់យ៉ាងឆាប់រហ័ស។ ពីមួយឆ្នាំទៅមួយឆ្នាំ សាកលវិទ្យាល័យមានមោទនភាពក្នុងការបញ្ជូនបុគ្គលមានសមត្ថភាពជាច្រើនទៅស្ថាប័នទាំងឯកជន និងសាធារណៈ។ និស្សិតដែលបានបញ្ចប់ការសិក្សាពីសាកលវិទ្យាល័យបច្ចុប្បន្នកំពុងបម្រើការនៅស្ថាប័នរដ្ឋាភិបាល ក្រសួង ស្ថាប័ននានា ក្រុមហ៊ុនឯកជន និងអង្គការអន្ដរជាតិមួយចំនួន។ ក្រៅពីតួនាទីនៃការផ្គត់ផ្គង់ធនធានមនុស្សសម្រាប់សង្គមកម្ពុជា សាកលវិទ្យាល័យភូមិន្ទនីតិសាស្ដ្រនិងវិទ្យាសាស្ដ្រសេដ្ឋកិច្ចបម្រើជាតួនាទីមួយទៀតគឺជាមាគ៌ាពីកម្ពុជាឆ្ពោះទៅពិភពលោក។ តួនាទីនេះត្រូវបានបង្ហាញដោយសហប្រតិបត្ដិការយ៉ាងច្រើនជាមួយស្ថាប័នអន្ដរជាតិ និងសាកលវិទ្យាល័យនានាតាមរយៈការផ្លាស់ប្ដូរនិស្សិត និងសមាជិកដេប៉ាតឹម៉ង់។ បុគ្គលិក និងនិស្សិតនៅសាកលវិទ្យាល័យ នៅក្នុងឆ្នាំ ២០០៣ មានសិស្សនិស្សិតបរិញ្ញាបត្រចំនួន ៤,៨០២ នាក់ដែលសិក្សាលើ ៤ មហាវិទ្យាល័យ។ ក្នុងចំណោមសិស្សទាំងនោះ មាននិស្សិតនារីចំនួន ១,៤៧៨ នាក់។ ចំណុចពិសេសមួយនៃចំណុចសំខាន់នៃសាកលវិទ្យាល័យ គឺការបង្ហាត់បង្រៀនដែលមានគុណភាពនិងបុគ្គលិករដ្ឋបាល។ បច្ចុប្បន្ននេះ ថ្នាក់ក្រោយឧត្ដមសិក្សាដែលទើបបង្កើតមានសិស្ស ៥០៧ នាក់។ មានសាស្ដ្រាចារ្យធ្វើការពេញម៉ោង ៨៤ នាក់ និងគ្រូបង្រៀនក្រៅម៉ោង ១១២ នាក់និង សាស្ដ្រាចារ្យបរទេសចំនួន ៧០ នាក់ដែលផ្ដល់ការបង្រៀនក្រោមកម្មវិធីផ្លាស់ប្ដូរនិស្សិត។ប្រព័ន្ធអប់រំវគ្គសិក្សាត្រូវបានបែងចែកជា ២ ឆមាស និងជា ៨ ឆមាសសម្រាប់ការសិក្សាបរិញ្ញបត្រទាំងមូល ៤ ឆ្នាំ។​ សាកលវិទ្យាល័យភូមិន្ទនីតិសាស្ដ្រនិងវិទ្យាសាស្ដ្រសេដ្ឋកិច្ចផ្ដល់កម្មវិធីសិក្សាជាមួយនឹងការផ្ដោតជាចំបងទៅលើនីតិសាស្ដ្រ សេដ្ឋកិច្ច និងការអប់រំពាណិជ្ជកម្ម។",
                     style: TextStyle(fontSize: 20))
                  ),
                )
              ],
            ),
          ))),
    );
  }
}