import 'package:flutter/material.dart';
import 'package:school_app/screens/setting_screen.dart';
import 'package:school_app/utils/color_util.dart';
import 'package:school_app/widgets/reusable_widget.dart';

class UbbPage extends StatelessWidget {
  const UbbPage({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      extendBodyBehindAppBar: true,
      appBar: AppBar(
        backgroundColor: Colors.transparent,
        centerTitle: false,
        title: const Text(
          "School Info",
          style: TextStyle(fontSize: 24, fontWeight: FontWeight.bold,color: Colors.black),
        ),
        actions: [
          IconButton(
            onPressed: (){
              Navigator.push(context,
                    MaterialPageRoute(builder: (context) {
                      const settingScreen =  SettingScreen();
                      return settingScreen;
                    }));
            },
            icon: const Icon(Icons.more_vert,color:Colors.black,),
          ),
        ],
      ),
      body: Container(
          width: MediaQuery.of(context).size.width,
          height: MediaQuery.of(context).size.height,
          decoration: BoxDecoration(
              gradient: LinearGradient(colors: [
            hexStringToColor("CB2B93"),
            hexStringToColor("9546C4"),
            hexStringToColor("5E61F4")
            ],
            begin: Alignment.topCenter,
            end: Alignment.bottomCenter,
            )),
          child: SingleChildScrollView(
            child: Padding(
             padding: const EdgeInsets.fromLTRB(20, 50, 20, 0),
             child: Column(
              children: <Widget>[
                ClipOval(
                child: SizedBox.fromSize(
                  size: const Size.fromRadius(90), // Image radius
                  child:  logoWidgetPublicSchoolScreen('asset/images/ubb.png'),
                  ),
                ),
                const SizedBox(
                  height: 10.0,
                ),
                Container(
                  decoration: BoxDecoration(
                    border: Border.all(
                      color: Colors.black,
                      width: 2,
                    ),
                    borderRadius: BorderRadius.circular(10),
                    boxShadow: const [
                      BoxShadow(
                        color: Color.fromARGB(125, 158, 158, 158),
                      ),
                    ],
                  ),
                  child: const Center(
                    child: Text("សាកល​វិទ្យា​ល័យ​បាត់​ដំបង​ គឺ​ជា​សាកល​វិទ្យា​ល័យ​របស់​រដ្ឋ​ធំ​ជាង​គេ​បំផុត​នៅ​ក្នុង​ភូមិ​ភាគ​ពាយព្យ​នៃ​ប្រទេស​កម្ពុជា​​ដែល​ត្រូវ​បាន​បង្កើត​ឡើង​ដោយ​អនុ​ក្រឹត្យ​លេខ​ ២៦. អ​ន​ក្រ.បក ​ចុះ​ថ្ងៃ​ទី ២១ ខែ មិនា ឆ្នាំ ២០០៧ ក្រោម​ការ​ផ្តួច​​​ផ្តើម​គំនិត​និង​កសាង​ដោយ​ ឯក​ឧត្តម​ ស​ខេង​ ឧប​នាយក​រដ្ឋ​មន្ត្រី​រដ្ឋ​មន្រ្តី​ក្រសួង​មហា​ផ្ទៃ​និង​ជា​តំណាង​រាស្រ្ត​ខេត្ត​បាត់​ដំបង ។ សិស្ស​និស្សិត​ទាំង​​អស់​នឹង​ទទួល​បាន​ដល់​ទៅ​ពីរ​ជំនាញ​ដោយ​សិស្ស​និស្សិត​ទាំង​អស់​បង់​លុយ​តែ​មួយ​ជំនាញ​ប៉ុណ្ណោះ​នៅ​ពេល​ដែល​សិស្ស​និស្សិត​ចូល​ឆ្នាំ​ទី ២ សាលា​តម្រូវ​ឲ្យ​ជ្រើស​រើស​ជំនាញ​ថ្មី​មួយ​ទៀត​ដែល​ខុស​ពី​ជំនាញ​ដើម​របស់​យើង​កំពុង​សិក្សា ។ ហេតុ​នេះ​ហើយ​ យើង​បាន​ទទួល​ចំនេះ​ដឹង​យ៉ាង​ច្រើន​ពី​សាកល​វិទ្យាល័យ​បាត់​ដំបង​ដែល​អាច​ឱ្យ​យើង​ងាយ​ស្រួល​ក្នុង​ការ​រក​ការងារ​ធ្វើ​និង​ងាយ​ស្រួល​ក្នុង​ការ​រៀន​សូត្រ​បន្ត​ទៅ​មុខ​ទៀត ។ សាកល​វិទ្យា​ល័យ​បាត់​ដំបង​បាន​បណ្តុះ​​បណ្តាល​ប្រកប​ដោយ​ធន​ធាន​មនុស្ស​ ពិត​ប្រាកដ​ដែល​សម​ស្រប​ទៅ​តាម​តម្រូវ​ការ​ទីផ្សារ​បច្នុប្បន្ន​និង​និស្សិត​ដែល​បាន​បណ្តុះ​បណ្តាល​នៅ​ទីនេះ​​ពោរពេញ​ទៅ​ដោយ​ចំនេះ​ដឹង​បទ​ពិសោធន៍​ប្រកប​ដោយ​គុណ​ភាព​និង​ចីរភាព​ការងារ​ទាំង​និសិត្ស​ប្រុសស្រី​ទាំង​អស់ ។ បន្ថែម​ពី​នេះ​ទៅ​ទៀត​សាកល​វិទ្យាល័យ​បាន​ធ្វើ​ការ​បណ្តុះ​បណ្តាល​បាន​និស្សិត​ជា​ច្រើន​នាក់​ក្នុង​រយៈ​ពេល​កន្លង​មក ។ លើស​ពី​នេះ​ទៅ​ទៀត​សាកល​វិទ្យាល័យ​បាត់​ដំបង​មាន​គោល​ដៅ​បាញ់​ឆ្ពោះ​ទៅ​រក​ភាព​រីក​ចំរើន​ទាំង​ការ​អប់​រំ​ផ្នែក​វិទ្យា​សាស្រ្ត​ពិត និង​ទាំង​ផ្នែក​សង្គម​ហើយ​ថែម​ទាំង​ពង្រឹង​ខាង​ផ្នែក​កសិកម្ម​ឲ្យ​សម​ស្រប​ទៅ​តាម​ប្រទេស​កសិកម្ម (ប្រទេស​កម្ពុជា) ។ មុខជំនាញ​បណ្ដុះបណ្ដាល​របស់​សាកលវិទ្យាល័យ​បាត់ដំបង​រួម​មាន៖ មហា​វិទ្យា​ល័យ​វិទ្យា​សាស្រ្ត និង​បច្ចេក​វិទ្យា, មហា​វិទ្យា​ល័យ​គ្រប់​គ្រង​ពាណិជ្ជ​កម្ម និង ទេសចរណ៍, មហាវិទ្យាល័យ​សង្គម​សាស្រ្ត​ និង អភិវឌ្ឍន៍​សហគមន៍។ សាកល​វិទ្យាល័យ​បាន​ពង្រឹង​យ៉ាង​តឹង​រឹង​ខ្ជាប់​ខ្ជួន​ផ្នែក​ខាង​វិន័យ​ដូច​ជា​សិស្ស​និសិ្សត​ទាំង​អស់​តម្រូវ​ឱ្យ​ស្លៀក​សំលៀក​បំពាក់​ខៀវ​ស​ព្រម​ទាំង​ មាន​ផ្លាក​ឡូហ្គូ​ដែល​បញ្ជាក់​ពី​ឈ្មោះ​របស់​សាកល​វិទ្យាល័យ ។ ហើយ​នៅ​ពេល​ដល់​ម៉ោង​ចូល​រៀន​សិស្ស​និស្សិត​ត្រូវ​តែ​ចូល​រៀន​ប្រសិន​បើ​សិស្ស​និស្សិត​មក​ជ្រុល​ម៉ោង​ ១៥​នាទី​នោះ​សាលា​នឹង​បិទ​ទ្វារ​មិន​ឱ្យ​ចូល​រៀន​ហើយ​សាលា​មិន​អនុញ្ញាត​ឲ្យ​សិស្ស​និស្សិត​ឡូឡា​និង​បង្ក​ភាព​រញ៉េរ​ញ៉ៃ បើ​សិស្ស​និស្សិត​មិន​គោរព​តាម​ច្បាប់​សាលា​ទេ​នោះ​នឹង​មាន​វិធាន​ការ​ផាក​ពិន័យ​ដល់​សិស្ស​និស្សិត​នោះ​ហើយ​សិស្ស​និស្សិត​ដែល​មិន​បាន​មក​រៀន​ច្រើន​សាលា​មិន​អនុញ្ញាត​ឱ្យ​ប្រលង​ឡើយ ។ នៅ​ពេល​ប្រលង​បញ្ចប់​ឆមាស​សាលា​បាន​រៀប​ចំវិន័យ​យ៉ាង​តឹង​រឹង​ដោយ​ឱ្យ​សិស្ស​និស្សិត​អង្គុយ​ឆ្ងាយ​ៗ​ពី​គ្នា​និង​មាន​អនុរក្ស​ដើរ​មើល​ពីរ​ទៅ​បី​នាក់​នៅ​ក្នុង​បន្ទប់​ប្រលង ។ សាស្រ្តា​ចារ្យ​ភាគ​ច្រើន​មាន​កម្រិត​សញ្ញា​ប័ត្រ​ចាប់​ពី​អនុ​បណ្ឌិត​ឡើង​ទៅ​ហើយ​ថែម​ទាំង​មាន​សាស្រ្តា​ចារ្យ​ជន​ជាតិ​បរទេស​និង​សាស្រ្តា​ចារ្យ​ជន​ជាតិ​ខែ្មរ​ដែល​កាន់​តែ​ធ្វើ​ឱ្យ​សាកល​វិទ្យា​ល័យ​បាត់​ដំបង​កាន់​តែ​មាន​ភាព​រីកចម្រើន​ និង​បចេ្ចក​ទេស​ក្នុង​ការ​បង្ហាត់​បង្រៀន​សិស្ស​និស្សិត​កាន់​តែ​ល្អ​ ។​ ក្នុង​នោះ​ដែរ​សាស្រា្ត​ចារ្យ​ក៏​មាន​ភាព​រាក់​ទាក់​សម្រាប់​ឱ្យ​សិស្ស​និស្សិត​ទាក់​ទង​សួរ​មេរៀន​តាម​រយៈ​ផ្ទាល់​មាត់​តាម​រយៈ​ទូរស័ព្ទ​និង​តាម​រយៈ​អ៊ីនធ័រណិត​​​នេះ​ហើយ​ដែល​អាច​ឱ្យ​សិស្ស​និស្សិត​មាន​ទំនុក​ចិត្ត​ខ្ពស់​ក្នុង​ការ​សិក្សា ។ សាកល​វិទ្យាល័យ​បាត់​ដំបង​ក៍​មាន​បុគ្គលិក ​ច្រើន​នាក់​សម្រាប់​បំរើ​ការ​នៅ​ក្នុង​សាកល​វិទ្យាល័យ​ដែល​បុគ្គលិក​ទាំង​អស់​នោះ​សុទ្ធ​តែ​មាន​សុជីវធម៍​មាន​បុគ្គលិក្ខណៈ​សមរម្យ រួស​រាយ​រាក់​ទាក់ ក្នុង​ការ​ផ្តល់​ពត៌​មាន​ផ្សេង​ៗ​ដល់​សិស្ស​និស្សិត​ឱ្យ​បាន​ដឹង​ និង បាន យល់ ។ សាកល​វិទ្យាល័យ​បាត់​ដំបង​មាន​ផ្តល់​សេវ៉ា​វគ្គ​ខ្លី​ៗ​ដោយ​ឥត​គិត​ថ្លៃ​សម្រាប់​សិស្ស​និស្សិត​ទាំង​អស់​ដែល​ចូល​មក​សិក្សា​នៅ​សាកល​វិទ្យាល័យ ​ដែល​ធ្វើ​ឱ្យ​សិស្ស​និស្សិត​ទាំង​អស់​ឆាប់​ចេះ​ឆាប់​យល់​និង​ឆាប់​ចាប់​បាន​ក្នុង​ការ​សិក្សា ។ ហើយ​ក៏​មាន​កម្ម​វិធី​ផ្សេង​ៗ​ដូច​ជា​ការ​ប្រគុំ​តន្រ្តី ​ការ​លេង​ល្បែង​ប្រជា​ប្រិយ​ផ្សេង​ៗ​នៅ​ពេល​មាន​បុណ្យ​ទាន​ការ​នាំ​សិស្ស​និស្សិត​ចុះ​ទៅ​ទស្សនៈ​កិច្ច​សិក្សា​នៅ​តាម​បណ្តា​ខេត្ត​នា​នា​និង​ការ​នាំ​សិស្ស​និស្សិត​ទៅ​ដើរ​លេង​កំសាន្ត​នៅ​តាម​រមនីយដ្ឋាន​នា​នា នៅ​តាម​ខេត្ត-ក្រុង ។ ",
                     style: TextStyle(fontSize: 20))
                  ),
                )
              ],
            ),
          ))),
    );
  }
}