import 'package:flutter/material.dart';
import 'package:school_app/screens/setting_screen.dart';
import 'package:school_app/utils/color_util.dart';
import 'package:school_app/widgets/reusable_widget.dart';

class UcPage extends StatelessWidget {
  const UcPage({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      extendBodyBehindAppBar: true,
      appBar: AppBar(
        backgroundColor: Colors.transparent,
        centerTitle: false,
        title: const Text(
          "School Info",
          style: TextStyle(fontSize: 24, fontWeight: FontWeight.bold,color: Colors.black),
        ),
        actions: [
          IconButton(
            onPressed: (){
              Navigator.push(context,
                    MaterialPageRoute(builder: (context) {
                      const settingScreen =  SettingScreen();
                      return settingScreen;
                    }));
            },
            icon: const Icon(Icons.more_vert,color:Colors.black,),
          ),
        ],
      ),
      body: Container(
          width: MediaQuery.of(context).size.width,
          height: MediaQuery.of(context).size.height,
          decoration: BoxDecoration(
              gradient: LinearGradient(colors: [
            hexStringToColor("CB2B93"),
            hexStringToColor("9546C4"),
            hexStringToColor("5E61F4")
            ],
            begin: Alignment.topCenter,
            end: Alignment.bottomCenter,
            )),
          child: SingleChildScrollView(
            child: Padding(
             padding: const EdgeInsets.fromLTRB(20, 50, 20, 0),
             child: Column(
              children: <Widget>[
                ClipOval(
                child: SizedBox.fromSize(
                  size: const Size.fromRadius(90), // Image radius
                  child:  logoWidgetPublicSchoolScreen('asset/images/uc.png'),
                  ),
                ),
                const SizedBox(
                  height: 10.0,
                ),
                Container(
                  decoration: BoxDecoration(
                    border: Border.all(
                      color: Colors.black,
                      width: 2,
                    ),
                    borderRadius: BorderRadius.circular(10),
                    boxShadow: const [
                      BoxShadow(
                        color: Color.fromARGB(125, 158, 158, 158),
                      ),
                    ],
                  ),
                  child: const Center(
                    child: Text("សាកលវិទ្យាល័យកម្ពុជា ត្រូវបានស្ថាបនាឡើងនៅថ្ងៃទី ២៣ ខែមិថុនា ឆ្នាំ២០០៣[៣] ដោយបណ្ឌិត កៅ គឹមហួន[៤] រដ្ឋមន្ត្រីប្រតិភូអមនាយករដ្ឋមន្ត្រី នៃព្រះរាជាណាចក្រកម្ពុជា ប្រធានក្រុមប្រឹក្សាភិបាល និងជាប្រធានសាកលវិទ្យាល័យកម្ពុជា[៥] និងបណ្ឌិត ហារុហ៊ីសា ហានដា[៦] ទីប្រឹក្សារាជរដ្ឋាភិបាលកម្ពុជា ស្ថាបនិក និងជាប្រធានមូលនិធិអន្តរជាតិ សំរាប់សិល្បៈ និងវប្បធម៌[៧] និងជាអធិការបតីសាកលវិទ្យាល័យកម្ពុជា។ សាកលវិទ្យាល័យកម្ពុជា ត្រូវបានទទួលស្គាល់ដោយរាជរដ្ឋាភិបាលកម្ពុជា [៩] និងគណៈកម្មាធិការទទួលស្គាល់គុណភាពអប់រំនៅកម្ពុជា និងជាសមាជិកសមាគមគ្រឹះស្ថានឧត្តមសិក្សានៅកម្ពុជា។ បាវចនារបស់សាកលវិទ្យាល័យកម្ពុជា គឺ “ដើម្បីចំណេះដឹង គតិបណ្ឌិត និងការស្ថាបនាអ្នកដឹកនាំទៅអនាគត”។[១២] បេសកកម្ម និងចក្ខុវិស័យរបស់សាកលវិទ្យាល័យ ផ្តោតជាសំខាន់លើការរៀបចំឱ្យប្រជាជនកម្ពុជាគ្រប់អាយុ ទទួលយកតួនាទីដឹកនាំ នៅក្នុងសង្គមតាមរយៈការអភិវឌ្ឍ ការពង្រឹង និងការធ្វើឱ្យប្រសើរឡើង នូវជំនាញវិភាគដោះស្រាយបញ្ហា និងសមត្ថភាពគិតត្រិះរិះ។ សាកលវិទ្យាល័យកម្ពុជា ប្រើប្រាស់ប្រព័ន្ធក្រេដីតរបស់សហរដ្ឋអាមេរិកជាគំរូ[១៥] ហើយកម្មវិធីសិក្សា ត្រូវបានបង្រៀនជាភាសាអង់គ្លេស។ នៅឆ្នាំ២០១៣ សាកលវិទ្យាល័យនេះ បានដាក់ចេញការបណ្តុះបណ្តាលជាភាសាខ្មែរ ដែលផ្តល់ជូននូវកម្មវិធីសិក្សាដូចគ្នានឹងភាសាអង់គ្លេស ប៉ុន្តែបង្រៀនជាភាសាខ្មែរ (កម្ពុជា)។ ក្រោយមកទៀត សាកលវិទ្យាល័យកម្ពុជា បានប្តូរឈ្មោះកម្មវិធីភាសាអង់គ្លេស ដែលមានស្រាប់ជា កម្មវិធី បណ្តុះបណ្តាលជាភាសាអន្តរជាតិ។ សាកលវិទ្យាល័យនេះ ត្រូវបានរៀបចំដើម្បីផ្តល់នូវកម្មវិធីឆ្នាំមូលដ្ឋាន បរិញ្ញាបត្ររង បរិញ្ញាបត្រ និងបណ្ឌិត តាមរយៈមហាវិទ្យាល័យ និងសាលាទាំង ៨ របស់ខ្លួន រួមមានមហាវិទ្យាល័យសិល្បៈ មនុស្សសាស្ត្រ និងភាសា មហាវិទ្យាល័យអប់រំ មហាវិទ្យាល័យច្បាប់ មហាវិទ្យាល័យព័ត៌មាន និងគមនាគមន៍[១៧] មហាវិទ្យាល័យវិទ្យាសាស្ត្រ និងបច្ចេកវិទ្យា មហាវិទ្យាល័យវិទ្យាសាស្ត្រសង្គម សាលាតេជោសែន កិច្ចការរដ្ឋាភិបាល និងទំនាក់ទំនងអន្តរជាតិ[១៨] និងសាលាពាណិជ្ជសាស្ត្រ តូនី ហ្វ៊រណានដេស (អតីតមហាវិទ្យាល័យគ្រប់គ្រង)។[១៩] លើសពីនេះ សាលាសម្រាប់ការបណ្តុះបណ្តាលកម្មវិធីសិក្សាក្រោយបរិញ្ញាបត្រ មើលការខុសត្រូវលើកម្មវធីសិក្សាក្រោយបរិញ្ញាបត្ររបស់សាកលវិទ្យាល័យ។ ជាមួយគ្នានឹងមហាវិទ្យាល័យ និងសាលា សាកលវិទ្យាល័យកម្ពុជា បានបង្កើតវិទ្យាស្ថាន និងមជ្ឈមណ្ឌលជាក់លាក់ ដើម្បីសម្របសម្រួលកិច្ចខិតខំប្រឹងប្រែងស្រាវជ្រាវ និងបណ្តុះបណ្តាល ជុំវិញមុខវិជ្ជាសិក្សា។[២១] សាកលវិទ្យាល័យនេះ មានវិទ្យាស្ថានស្រាវជ្រាវ និងសិក្សាជាន់ខ្ពស់ (IRAS)[២២]ក្រុមប្រឹក្សាស្រាវជ្រាវ និងប្រឌិត ញាណ (CRC)[២៣] មជ្ឈមណ្ឌលសិក្សាអាស៊ាន (ASC)[២៤] មជ្ឈមណ្ឌលអភិវឌ្ឍន៍ជំនាញ និងវិជ្ជាជីវៈ (SCDC)[២៥] មជ្ឈមណ្ឌលសិក្សាភាសាអង់គ្លេស (CES)[២៦] និងមជ្ឈមណ្ឌលភាពជាអ្នកដឹកនាំអាស៊ី (ALC)។[២៧] បន្ថែមពីនេះ សាកលវិទ្យាល័យក៏បានបង្កើតក្រុមវិភាគី ដូចជា វេទិកាសេដ្ឋកិច្ចអាស៊ី (AEF) នៅខែឧសភា ឆ្នាំ២០០៥[២៨] និងក្រោយមកបានបង្កើត កិច្ចសន្ទនាអភិវឌ្ឍទំនុកចិត្តអាស៊ី (AFDD)។ សាកលវិទ្យាល័យកម្ពុជា បានកើនប្រជាប្រិយភាព ដោយសារជោគជ័យរបស់ក្លឹបនិស្សិត និងអង្គការជាច្រើនរបស់ខ្លួន និយាយឱ្យចំគឺ សភានិស្សិតសាកលវិទ្យាល័យកម្ពុជា (UCSS)[៣០] ក្លឹបយុវជនកាកបាទក្រហមកម្ពុជារបស់សាកលវិទ្យាល័យកម្ពុជា (UCCRCY)[៣១] ក្លឹបពិភាក្សាសាកលវិទ្យាល័យកម្ពុជា (UCDC)[៣២][៣៣] ក្លឹបកីឡាសាកលវិទ្យាល័យកម្ពុជា[៣៤] សមាគមអតីតនិស្សិតសាកលវិទ្យាល័យកម្ពុជា (UCAA)[៣៥] និងក្លឹបសាកវប្បកម្មសាកលវិទ្យាល័យកម្ពុជា (UCHC)។[៣៦] សាកលវិទ្យាល័យ ក៏មានព្រឹត្តិបត្រផ្លូវការផ្ទាល់ខ្លួនរាល់ត្រីមាស ហៅថា ព្រឹត្តិបត្រសាកលវិទ្យាល័យកម្ពុជា ដែលមានការចូលរួមវិភាគទានជាទូទៅ ពីបុគ្គលិក សាស្ត្រាចារ្យ និស្សិត អតីតនិស្សិត និងអ្នកចូលវិភាគទានពិសេសៗផ្សេងទៀត។ លើសពីនេះ សាកលវិទ្យាល័យកម្ពុជា រក្សាទំនាក់ទំនងផ្លូវការជាច្រើន តាមរយៈការចុះអនុស្សរណៈយោគយល់គ្នា ជាមួយបណ្តាស្ថាប័នថ្នាក់ជាតិ និងអន្តរជាតិ អង្គការ និងមេដឹកនាំឧស្សាហកម្មជាច្រើន។សាកលវិទ្យាល័យកម្ពុជា អនុញ្ញាតឱ្យនិស្សិតថ្នាក់ក្រោយបរិញ្ញបត្រ និងបរិញ្ញាបត្រ ចូលរៀន ៣ ដងក្នុងមួយឆ្នាំ ៖ ចុងខែតុលា ចុងខែវិច្ឆិកា និងចុងខែមិថុនា។ ប៉ុន្តែ សិស្សនៅមជ្ឈមណ្ឌលសិក្សាភាសាអង់គ្លេស អាចចុះឈ្មោះចូលរៀន បាន ៥ ដងខុសៗគ្នា ក្នុងមួយឆ្នាំ តាមកាលវិភាគឆ្លាស់គ្នា។ សាកលវិទ្យាល័យកម្ពុជាមានមហាវិទ្យាល័យចំនួន ៦ និងសាលាចំនួន ២៖ មហាវិទ្យាល័យសិល្បៈ មនុស្សសាស្ត្រ និងភាសា មហាវិទ្យាល័យអប់រំ មហាវិទ្យាល័យច្បាប់ មហាវិទ្យាល័យព័ត៌មាន និងគមនាគមន៍ មហាវិទ្យាល័យវិទ្យាសាស្ត្រ និងបច្ចេកវិទ្យា មហាវិទ្យាល័យវិទ្យាសាស្ត្រសង្គម សាលាតេជោសែន កិច្ចការ រដ្ឋាភិបាល និងទំនាក់ទំនងអន្តរជាតិ និងសាលាពាណិជ្ជសាស្ត្រ តូនី ហ្វ៊រណានដេស (អតីតមហាវិទ្យាល័យ គ្រប់គ្រង)។[៣៩] សាកលវិទ្យាល័យនេះ ផ្តល់ជូននូវសញ្ញាបត្របរិញ្ញាបត្ររង បរិញ្ញាបត្រ បរិញ្ញាបត្រជាន់ខ្ពស់ និងបណ្ឌិត លើមុខវិជ្ជាជាច្រើន។ កម្មវិធីសិក្សាថ្នាក់បរិញ្ញាបត្រជាន់ខ្ពស់ចំនួន ៣ របស់សាកលវិទ្យាល័យកម្ពុជា ត្រូវបានជាប់ចំណាត់ថ្នាក់ជាកម្មវិធីសិក្សាកំពូល នៅក្នុងវិស័យសិក្សារបស់ខ្លួន នៅចុងអាស៊ីអាគ្នេយ៍ បើយោងតាម Eduniversal។ មហាវិទ្យាល័យមាន មហាវិទ្យាល័យសិល្បៈ មនុស្សសាស្ត្រ និងភាសា (CoAHL), មហាវិទ្យាល័យអប់រំ (CoE), មហាវិទ្យាល័យច្បាប់ (CoL), មហាវិទ្យាល័យព័ត៌មាន និងគមនាគមន៍ (CMC), មហាវិទ្យាល័យវិទ្យាសាស្ត្រ និងបច្ចេកវិទ្យា (CoST), មហាវិទ្យាល័យវិទ្យាសាស្ត្រសង្គម (CoSS), សាលាតេជោសែន កិច្ចការរដ្ឋាភិបាល និងទំនាក់ទំនងអន្តរជាតិ (TSS), សាលាពាណិជ្ជសាស្ត្រ តូនី ហ្វ៊រណានដេស (អតីតមហាវិទ្យាល័យគ្រប់គ្រង) (TFSB), សាលាសម្រាប់ការបណ្តុះបណ្តាលកម្មវិធីសិក្សាក្រោយបរិញ្ញាបត្រ (SGS), សាលាសម្រាប់ការបណ្តុះបណ្តាលកម្មវិធីសិក្សាបរិញ្ញាបត្រ (SUS)។",
                     style: TextStyle(fontSize: 20))
                  ),
                )
              ],
            ),
          ))),
    );
  }
}